// src/data/formation.js

export const formations = {
  8: [
    "마피아대부", "히트맨", "마피아일원",
    "경찰반장", "자경단원", "사립탐정", "순찰경찰", "탐정조수"
  ],
  9: [
    "마피아대부", "히트맨", "마피아일원",
    "경찰반장", "자경단원", "사립탐정", "순찰경찰", "탐정조수", "공무원"
  ],
  10: [
    "마피아대부", "히트맨", "마피아일원", "마피아후계자",
    "경찰반장", "자경단원", "사립탐정", "순찰경찰", "탐정조수", "공무원"
  ],
  11: [
    "마피아대부", "히트맨", "마피아일원", "마피아후계자",
    "경찰반장", "자경단원", "사립탐정", "순찰경찰", "탐정조수",
    "남자연인", "여자연인"
  ],
  12: [
    "마피아대부", "히트맨", "마피아일원", "마피아후계자", "스파이",
    "경찰반장", "자경단원", "사립탐정", "순찰경찰", "탐정조수",
    "남자연인", "여자연인"
  ],
  13: [
    "마피아대부", "히트맨", "마피아일원", "마피아후계자", "스파이",
    "경찰반장", "자경단원", "사립탐정", "순찰경찰", "탐정조수",
    "남자연인", "여자연인", "공무원"
  ]
};
